Revit 2026 API

# GridNode Methods

---

The GridNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Indicates whether this instance and a specified object are equal.(Inherited from ValueType) |
|  | GetHashCode | Returns the hash code for this instance.(Inherited from ValueType) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns the fully qualified type name of this instance.(Inherited from ValueType) |

#### Reference

GridNode Structure

Autodesk.Revit.DB Namespace